#!/usr/bin/env python
# -*- coding: utf-8 -*-
from ordereddict import OrderedDict
username = "admmsm"
password = "msm-bus"
remote_path = "/0/"
local_path = "recieved/"
station = OrderedDict(sorted({
	"140100": {"name": u"Южный", 				"ip": "10.14.1.1"},
	"142100": {"name": u"Харцызск", 			"ip": "10.14.1.1"},
	"142200": {"name": u"Зугрэс", 				"ip": "10.14.1.1"},
	"142300": {"name": u"Шахтерск", 			"ip": "10.14.1.1"},
	"142400": {"name": u"Торез", 				"ip": "10.14.1.1"},
	"142500": {"name": u"Снежное", 				"ip": "10.14.1.1"},
	"142800": {"name": u"Дебальцево", 			"ip": "10.14.1.1"},
	"143400": {"name": u"Докучаевск", 			"ip": "10.14.1.1"},
	"145000": {"name": u"Мариуполь", 			"ip": "10.14.1.1"},
	"145100": {"name": u"Новоазовск", 			"ip": "10.14.1.1"},
	"145200": {"name": u"Курахово", 			"ip": "10.14.1.1"},
	"146100": {"name": u"Красноармейск", 		"ip": "10.14.1.1"},
	"146150": {"name": u"Доброполье", 			"ip": "10.14.1.1"},
	"146200": {"name": u"Краматорск", 			"ip": "10.14.1.1"},
	"146300": {"name": u"Славянск", 			"ip": "10.14.1.1"},
	"146400": {"name": u"Артемовск", 			"ip": "10.14.1.1"},
	"146500": {"name": u"Дружковка", 			"ip": "10.14.1.1"},
	"146550": {"name": u"Константиновка", 		"ip": "10.14.1.1"},
	"146600": {"name": u"Святогорск", 			"ip": "10.14.1.1"},
	"146700": {"name": u"Горловка", 			"ip": "10.14.1.1"},
	"146900": {"name": u"Енакиево", 			"ip": "10.14.1.1"},
	"147000": {"name": u"Восточный", 			"ip": "10.14.1.1"}		
	}.items(), key=lambda station: station[1]))